Show / Hide Table of Contents
Class SectionCharacteristics
Section characteristics
Inheritance
System.Object
SectionCharacteristics
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Geometry2D
Assembly: IdeaRS.OpenModel.dll
Syntax
public class SectionCharacteristics
Properties
Improve this Doc   View Source
A
Gets or sets the area.
Declaration
public double A { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Ay
Shear area
Declaration
public double Ay { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Az
Shear area
Declaration
public double Az { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Cgy
Gets the centre of gravity related to the axis Y.
Declaration
public double Cgy { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Cgz
Gets the centre of gravity related to the axis Z.
Declaration
public double Cgz { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Dyz
Gets or sets the product moment of area.
Declaration
public double Dyz { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
E
Gets or sets the responding E modulus.
Declaration
public double E { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
It
Gets or sets the Torsional constant.
Declaration
public double It { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Iw
Gets or sets the Warping constant.
Declaration
public double Iw { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Iy
Gets or sets the second moment of area related to the Y axis.
Declaration
public double Iy { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Iz
Gets or sets the second moment of area related to the Z axis.
Declaration
public double Iz { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Rgy
Gets the radius of gyration related to the axis Y. Also known as iy.
Declaration
public double Rgy { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Rgz
Gets the radius of gyration related to the axis Z. Also known as iz.
Declaration
public double Rgz { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Sy
Gets or sets the first moment of area related to the Y axis.
Declaration
public double Sy { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Sz
Gets or sets the first moment of area related to the Z axis.
Declaration
public double Sz { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Wely
Gets or sets the Elastic section modulus related to axis Y.
Declaration
public double Wely { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Welz
Gets or sets the Elastic section modulus related to axis Z.
Declaration
public double Welz { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Wply
Gets or sets the Plastic section modulus related to axis Y.
Declaration
public double Wply { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Wplz
Gets or sets the Plastic section modulus related to axis Z.
Declaration
public double Wplz { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Y0
Gets or sets the Shear center coordinate Y related to the center of gravity.
Declaration
public double Y0 { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Z0
Gets or sets the Shear center coordinate Z related to the center of gravity.
Declaration
public double Z0 { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source